In [ ]:
Midterm: Jalen Pryor qcf7hc

In [8]:
import os
import json
import numpy
import datetime
import pandas as pd

import pymongo
from sqlalchemy import create_engine

Connect to mongodb and send data to it

In [ ]:
First, write connection to mongodb

In [7]:
mysql_uid = "root"
mysql_pwd = "Passw0rd123"
host_name = "localhost"
host_ip = "127.0.0.1"
port = "3306"

atlas_cluster_name = "cluster.kjbg3fh"
atlas_user_name = "qcf7hc"
atlas_password = "Passw0rd123"

conn_str = {"local" : f"mongodb://localhost:27017/",
    "atlas" : f"mongodb+srv://{atlas_user_name}:{atlas_password}@{atlas_cluster_name}.mongodb.net"
}

src_dbname = "sakila"
dst_dbname = "sakila_dw2"

print(f"Local Connection String: {conn_str['local']}")
print(f"Atlas Connection String: {conn_str['atlas']}")

Local Connection String: mongodb://localhost:27017/
Atlas Connection String: mongodb+srv://qcf7hc:Passw0rd123@cluster.kjbg3fh.mongodb.net

In [ ]:
Set up dataframe functions:

In [9]:
def get_sql_dataframe(user_id, pwd, db_name, sql_query):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    
    '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
    conn = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, conn);
    conn.close()
    
    return dframe


def get_mongo_dataframe(connect_str, db_name, collection, query):
    '''Create a connection to MongoDB'''
    client = pymongo.MongoClient(connect_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    return dframe


def set_dataframe(user_id, pwd, db_name, df, table_name, pk_column, db_operation):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    '''Invoke the Pandas DataFrame .to_sql( ) function to either create, or append to, a table'''
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()
def get_dataframe(user_id, pwd, host_name, db_name, sql_query):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, connection);
    connection.close()
    
    return dframe

In [4]:
os.getcwd()
os.chdir('C:\\Users\\ds2002-02-student\\Documents\\DS-2002-002-main\\DS-2002-002-main\\01-SQL\\Labs')

In [ ]:
Taking json files and sending it to MongoDB

In [5]:
client = pymongo.MongoClient(conn_str["atlas"])
db = client[src_dbname]

# Gets the path of the Current Working Directory for this Notebook, and then Appends the 'data' directory.

data_dir = os.path.join(os.getcwd(), 'Data')

json_files = {"customers" : 'sakila_customers.json',
             
             }

for file in json_files:
    db.drop_collection(file)
    json_file = os.path.join(data_dir, json_files[file])
    with open(json_file, 'r') as openfile:
        json_object = json.load(openfile)
        file = db[file]
        result = file.insert_many(json_object)
        #print(f"{file} was successfully loaded.")

        
client.close()

In [ ]:
Extract the mongodb data to make new dimension table

In [6]:
query = {}
collection = "customers"

df_customers = get_mongo_dataframe(conn_str['atlas'], src_dbname, collection, query)
df_customers.head(2)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-15 04:57:20

In [ ]:
transform dimension table

In [7]:
df_customers.rename(columns={"customer_id":"customer_key",'store_id':'store_key','address_id':'customer_address_key','active':'Status'}, inplace=True)
drop_cols = ['create_date','last_update']
df_customers.drop(drop_cols, axis=1, inplace=True)
df_customers.head(2)

,customer_key,store_key,first_name,last_name,email,customer_address_key,Status
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1

In [ ]:
send dimension tables to mysql workbench

In [8]:
dataframe = df_customers
table_name = 'dim_customers'
primary_key = 'customer_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [ ]:
validate

In [10]:
sql_customers = "SELECT * FROM sakila_dw2.dim_customers;"
df_dim_customers = get_sql_dataframe(mysql_uid, mysql_pwd, dst_dbname, sql_customers)
df_dim_customers.head(2)

,customer_key,store_key,first_name,last_name,email,customer_address_key,Status
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1

In [ ]:
read json file from local files

In [10]:
df_stores = pd.read_json('C:\\Users\\ds2002-02-student\\Documents\\DS-2002-002-main\\DS-2002-002-main\\01-SQL\\Labs\\Data\\sakila_store.json')
df_stores.head(2)

   store_id  manager_staff_id  address_id          last_update
0         1                 1           1  2006-02-15 04:57:12
1         2                 2           2  2006-02-15 04:57:12

In [ ]:
transform file

In [11]:
df_stores.rename(columns={"store_id":"store_key",'manager_staff_id':'manager_staff_key','address_id':'store_address_key'}, inplace=True)
drop_cols = ['last_update']
df_stores.drop(drop_cols, axis=1, inplace=True)
df_stores.head(2)

   store_key  manager_staff_key  store_address_key
0          1                  1                  1
1          2                  2                  2

In [ ]:
send to my sql

In [12]:
dataframe = df_stores
table_name = 'dim_stores'
primary_key = 'store_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [ ]:
validate

In [11]:
sql_stores = "SELECT * FROM sakila_dw2.dim_stores;"
df_dim_stores = get_sql_dataframe(mysql_uid, mysql_pwd, dst_dbname, sql_stores)
df_dim_stores.head(2)

   store_key  manager_staff_key  store_address_key
0          1                  1                  1
1          2                  2                  2

In [ ]:
populate fact table with payment table

In [ ]:
First, read in payment table from mysql workbench

In [18]:
sql_payments = "SELECT * FROM sakila.payment;"
df_payments = get_dataframe(mysql_uid, mysql_pwd, host_name, src_dbname, sql_payments)
df_payments.head(2)

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,1,1,1,76,2.99,2005-05-25 11:30:37,2006-02-15 22:12:30
1,2,1,1,573,0.99,2005-05-28 10:35:23,2006-02-15 22:12:30

In [ ]:
transform table

In [19]:
df_payments.rename(columns={"payment_id":"payment_key",'customer_id':'customer_key','rental_id':'rental_key','staff_id':'staff_key','amount':'Price'}, inplace=True)
drop_cols = ['last_update']
df_payments.drop(drop_cols, axis=1, inplace=True)
df_payments.head(2)

   payment_key  customer_key  staff_key  rental_key  Price        payment_date
0            1             1          1          76   2.99 2005-05-25 11:30:37
1            2             1          1         573   0.99 2005-05-28 10:35:23

In [ ]:
send to mysql workbench

In [20]:
dataframe = df_payments
table_name = 'dim_fact_payments'
primary_key = 'payment_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [ ]:
validate

In [12]:
sql_payments = "SELECT * FROM sakila_dw2.dim_fact_payments;"
df_dim_fact_payments = get_sql_dataframe(mysql_uid, mysql_pwd, dst_dbname, sql_payments)
df_dim_fact_payments.head(2)

   payment_key  customer_key  staff_key  rental_key  Price  payment_date_key
0            1             1          1          76   2.99          20050525
1            2             1          1         573   0.99          20050528

In [ ]:
merge with date dimension table in mysql (this part was done in mysql workbench)

In [23]:
sql_fact_payments = "SELECT * FROM sakila_dw2.dim_fact_payments;"
df_dim_fact_payments = get_dataframe(mysql_uid, mysql_pwd, host_name, src_dbname, sql_fact_payments)
df_dim_fact_payments.head(2)

   payment_key  customer_key  staff_key  rental_key  Price  payment_date_key
0            1             1          1          76   2.99          20050525
1            2             1          1         573   0.99          20050528

In [ ]:
merge primary keys from dimension tables to fact table

In [24]:
df_fact_payments_table = pd.merge(df_dim_fact_payments, df_dim_customers, on='customer_key', how='inner')
df_fact_payments_table.drop(['first_name','last_name','email'], axis=1, inplace=True)
df_fact_payments_table.insert(0, "fact_payment_key", range(1, df_fact_payments_table.shape[0]+1))

df_fact_payments_table.head(2)

,fact_payment_key,payment_key,customer_key,staff_key,rental_key,Price,payment_date_key,store_key,customer_address_key,Status
0,1,1,1,1,76,2.99,20050525,1,5,1
1,2,2,1,1,573,0.99,20050528,1,5,1

In [25]:
df_fact_payments_table = pd.merge(df_fact_payments_table, df_dim_stores, on='store_key', how='inner') 
df_fact_payments_table.head(10)

,fact_payment_key,payment_key,customer_key,staff_key,rental_key,Price,payment_date_key,store_key,customer_address_key,Status,manager_staff_key,store_address_key
0,1,1,1,1,76,2.99,20050525,1,5,1,1,1
1,2,2,1,1,573,0.99,20050528,1,5,1,1,1
2,3,3,1,1,1185,5.99,20050615,1,5,1,1,1
3,4,4,1,2,1422,0.99,20050615,1,5,1,1,1
4,5,5,1,2,1476,9.99,20050615,1,5,1,1,1
5,6,6,1,1,1725,4.99,20050616,1,5,1,1,1
6,7,7,1,1,2308,4.99,20050618,1,5,1,1,1
7,8,8,1,2,2363,0.99,20050618,1,5,1,1,1
8,9,9,1,1,3284,3.99,20050621,1,5,1,1,1
9,10,10,1,2,4526,5.99,20050708,1,5,1,1,1

In [ ]:
Reordering columns

In [26]:
ordered_columns = ['fact_payment_key','payment_key','rental_key','customer_key', 'customer_address_key','staff_key','manager_staff_key','store_key','store_address_key','payment_date_key','Price','Status']
df_fact_payments_table = df_fact_payments_table[ordered_columns]
df_fact_payments_table.head(2)

,fact_payment_key,payment_key,rental_key,customer_key,customer_address_key,staff_key,manager_staff_key,store_key,store_address_key,payment_date_key,Price,Status
0,1,1,76,1,5,1,1,1,1,20050525,2.99,1
1,2,2,573,1,5,1,1,1,1,20050528,0.99,1

In [ ]:
Send to mysql workbench

In [27]:
dataframe = df_fact_payments_table
table_name = 'dim_fact_payments_table'
primary_key = 'fact_payment_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [ ]:
validate

In [13]:
sql_fact_table = "SELECT * FROM sakila_dw2.dim_fact_payments_table;"
df_dim_fact_payments_table = get_sql_dataframe(mysql_uid, mysql_pwd, dst_dbname, sql_fact_table)
df_dim_fact_payments_table.head(2)

,fact_payment_key,payment_key,rental_key,customer_key,customer_address_key,staff_key,manager_staff_key,store_key,store_address_key,payment_date_key,Price,Status
0,1,1,76,1,5,1,1,1,1,20050525,2.99,1
1,2,2,573,1,5,1,1,1,1,20050528,0.99,1

In [ ]:
select statement summing up total prices for each customer and sending back their last name, the total amount they paid, and their customer key/id

In [16]:
sql_test = """
select customers.`last_name` as `customer_name`,
    sum(payments.`Price`) as `total_price`,
    fact.`customer_key`
from `{0}`.`dim_fact_payments` as payments
inner join `{0}`.`dim_customers` as customers
on payments.customer_key = customers.customer_key 
inner join `{0}`.`dim_fact_payments` as fact
on payments.customer_key = fact.customer_key
group by customers.`last_name`,
fact.`customer_key`
order by total_price desc;

""".format(dst_dbname)

df_test1 = get_sql_dataframe(mysql_uid,mysql_pwd,dst_dbname, sql_test)
df_test1.head(5)

  customer_name  total_price  customer_key
0          SEAL      9969.75           526
1          HUNT      9960.84           148
2          SHAW      8214.36           144
3        SNYDER      7589.79           178
4       KENNEDY      7589.79           137